**Grouping and aggregation using .groupby() method**

The process of grouping rows of data together and performing aggregation on numerical columns is called grouping and aggregation. 
**Aggregation** is the process of grouping multiple values together to form a single summary value.

In [2]:
import pandas as pd


df = pd.read_excel('Data_dump_10_rows.xlsx', sheet_name = 'Sheet1')
df

   0 FirstName   LastName  Gender        Country  Age       Date    Id
0  1     Dulce      Abril  Female  United States   32 2017-10-15  1562
1  2      Mara  Hashimoto  Female  Great Britain   25 2016-08-16  1582
2  3    Philip       Gent    Male        France    36 2015-05-21  2587
3  4  Kathleen     Hanner  Female  United States   25 2017-10-15  3549
4  5   Nereida    Magwood  Female  United States   58 2016-08-16  2468
5  6    Gaston      Brumm    Male  United States   24 2015-05-21  2554
6  7      Etta      Hurn   Female  Great Britain   56 2017-10-15  3598
7  8   Earlean     Melgar  Female  United States   27 2016-08-16  2456
8  9  Vincenza    Weiland  Female  United States   40 2015-05-21  6548

In [3]:
df1 = df[['Gender', 'Country', 'Age']]
df1

   Gender        Country  Age
0  Female  United States   32
1  Female  Great Britain   25
2    Male        France    36
3  Female  United States   25
4  Female  United States   58
5    Male  United States   24
6  Female  Great Britain   56
7  Female  United States   27
8  Female  United States   40

**grouping by single column**

In [5]:
by_country = df1.groupby(['Country'])

In [6]:
by_country.mean(numeric_only = True)

                     Age
Country
France         36.000000
Great Britain  40.500000
United States  34.333333

In [7]:
by_country.max() # maximum age in each country

               Gender  Age
Country
France           Male   36
Great Britain  Female   56
United States    Male   58

In [8]:
by_country.min() # minimum age in each country

               Gender  Age
Country
France           Male   36
Great Britain  Female   25
United States  Female   24

In [9]:
by_country.count() # count of people in each country

               Gender  Age
Country
France              1    1
Great Britain       2    2
United States       6    6

In [10]:
by_country.std(numeric_only = True) # standard deviation

                     Age
Country
France               NaN
Great Britain  21.920310
United States  13.002564

In [11]:
by_country.describe()

                Age
              count       mean        std   min    25%   50%    75%   max
Country
France          1.0  36.000000        NaN  36.0  36.00  36.0  36.00  36.0
Great Britain   2.0  40.500000  21.920310  25.0  32.75  40.5  48.25  56.0
United States   6.0  34.333333  13.002564  24.0  25.50  29.5  38.00  58.0

Grouping by multiple columns

In [12]:
by_country = df1.groupby(['Country', 'Gender'])

In [13]:
by_country.count() # count each gender in a country

                      Age
Country       Gender
France        Male      1
Great Britain Female    2
United States Female    5
              Male      1

In [14]:
by_country.mean() # mean age of every gender in the country

                       Age
Country       Gender
France        Male    36.0
Great Britain Female  40.5
United States Female  36.4
              Male    24.0

In [15]:
by_country.min()

                      Age
Country       Gender
France        Male     36
Great Britain Female   25
United States Female   25
              Male     24

In [16]:
by_country.describe()

                       Age
                     count  mean        std   min    25%   50%    75%   max
Country       Gender
France        Male     1.0  36.0        NaN  36.0  36.00  36.0  36.00  36.0
Great Britain Female   2.0  40.5  21.920310  25.0  32.75  40.5  48.25  56.0
United States Female   5.0  36.4  13.390295  25.0  27.00  32.0  40.00  58.0
              Male     1.0  24.0        NaN  24.0  24.00  24.0  24.00  24.0

In [17]:
by_country.std()

                            Age
Country       Gender
France        Male          NaN
Great Britain Female  21.920310
United States Female  13.390295
              Male          NaN

In [18]:
by_country.describe().transpose()

Country   France  Great Britain United States
Gender       Male        Female        Female  Male
Age count     1.0       2.00000      5.000000   1.0
    mean     36.0      40.50000     36.400000  24.0
    std       NaN      21.92031     13.390295   NaN
    min      36.0      25.00000     25.000000  24.0
    25%      36.0      32.75000     27.000000  24.0
    50%      36.0      40.50000     32.000000  24.0
    75%      36.0      48.25000     40.000000  24.0
    max      36.0      56.00000     58.000000  24.0

In [19]:
by_country.describe().transpose()['United States'] # aggregation for a single country

Gender        Female  Male
Age count   5.000000   1.0
    mean   36.400000  24.0
    std    13.390295   NaN
    min    25.000000  24.0
    25%    27.000000  24.0
    50%    32.000000  24.0
    75%    40.000000  24.0
    max    58.000000  24.0

**PIVOT TABLES**

A pivot table is used to summarise, sort, reorganize, group, count, total or average data stored in a table.
It allows grouping by any field(column), and it performs statistical calculations on them.
It allows us to transform columns into rows and rows into columns

In [20]:
try:
    df = pd.read_excel('Excel_Sample.xlsx') # reading from an excel file
except Exception as e:
    print(f"Error occured: {e}")

In [21]:
df

,Unnamed: 0,0,FirstName,LastName,Gender,Country,Age,Date,Id
0,0,1,Dulce,Abril,Female,United States,32,2017-10-15,1562
1,1,2,Mara,Hashimoto,Female,Great Britain,25,2016-08-16,1582
2,2,3,Philip,Gent,Male,France,36,2015-05-21,2587
3,3,4,Kathleen,Hanner,Female,United States,25,2017-10-15,3549
4,4,5,Nereida,Magwood,Female,United States,58,2016-08-16,2468
5,5,6,Gaston,Brumm,Male,United States,24,2015-05-21,2554
6,6,7,Etta,Hurn,Female,Great Britain,56,2017-10-15,3598
7,7,8,Earlean,Melgar,Female,United States,27,2016-08-16,2456
8,8,9,Vincenza,Weiland,Female,United States,40,2015-05-21,6548

In [22]:
df.pivot_table(values = 'Age', index = ['Country'], columns = ['Gender']) # creating a pivot table

Gender         Female  Male
Country
France            NaN  36.0
Great Britain    40.5   NaN
United States    36.4  24.0

In [23]:
import numpy as np

df.pivot_table(values = 'Age', index = ['Country'], columns = ['Gender'], aggfunc = {'Age':['min','max', 'mean', 'sum']}) # creating a pivot table

                 max         mean          min          sum
Gender        Female  Male Female  Male Female  Male Female  Male
Country
France           NaN  36.0    NaN  36.0    NaN  36.0    NaN  36.0
Great Britain   56.0   NaN   40.5   NaN   25.0   NaN   81.0   NaN
United States   58.0  24.0   36.4  24.0   25.0  24.0  182.0  24.0